src/server/app/controllers/v1/articles_controller.rb

  def index
    #@v1_articles = Article.all
    @v1_articles = Article.order('created_at DESC')
---
SELECT `articles`.* FROM `articles` ORDER BY created_at DESC

  def create
    @v1_article = Article.new(v1_article_params)

    if @v1_article.save
---
INSERT INTO `articles` (`title`, `price`, `description`, `created_at`, `updated_at`, `avatar`) VALUES ('صورة شخصية', '564', 'sdkjflsmdlj', '2019-05-23 06:49:53', '2019-05-23 06:49:53', 'outerspaceHands.jpg')

  def update
    if @v1_article.update(v1_article_params)
---
UPDATE `articles` SET `price` = '18.49', `avatar` = '3.jpg', `updated_at` = '2019-05-24 03:47:03' WHERE `articles`.`id` = 9

  def destroy
    @v1_article.destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 5

    def set_v1_article
      @v1_article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1