src/server/app/controllers/tokens_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'neffar' LIMIT 1
---
  def create
    user = User.find_by(username: params[:username])