src/server/app/controllers/users_controller.rb

  def create
    input = User.new(params.permit(:username, :password))
    if(input.save)
---
INSERT INTO `users` (`username`, `password_digest`, `created_at`, `updated_at`) VALUES ('neffar', '$2a$10$fnuMVTz7cqAGK7nHYb1T7edRIpg3xc8yRrn.IyDFWumyLhlmB44dC', '2019-05-23 01:22:32', '2019-05-23 01:22:32')